rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
  def similar_director
    @id = params[:movie_id]
    @movie = Movie.find(@id)

INSERT INTO "movies" ("title", "rating", "description", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Teste"], ["rating", "PG"], ["description", "A"], ["director", "The"], ["created_at", "2015-12-08 00:33:00.897204"], ["updated_at", "2015-12-08 00:33:00.897204"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["release_date", "2015-12-08 01:08:04.000000"], ["updated_at", "2015-12-08 01:08:04.331209"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)